#include <stdio.h>
#include <stdlib.h>

/*
数组

* 初始化数组的时候需要指定数组的大小，不能动态的定义，不能用变量规范数组的大小

* 数组可以在定义的时候初始化
    * int a[] = {1,2,3};  // 在编译时候运行，减少执行时间，可以不指定数组的长度
    * int a[10] = {1,2,3,4,5};  // 从第五个数后都是 0
    * int a[10] = {0};  // 将一个数组的元素都赋值为 0

* 二维数组的引用和初始化
    * int a[3][4] = {{1,2,3,4}, {1,2,3,4}, {1,2,3,4}}; // 几维数组就套几个花括号
    * int a[3][4] = {1,2,3,4,1,2,3,4,1,2,3,4};  // 写在一个花括号里面，按照存储的顺序就行
    * int a[3][4] = {{1}, {4}, {7}};  // 只对部分的数据赋初始

*

*/

int main(){
	
//    int a[100] = {1,2,3,4,5};
//    int a[3][4] = {{1,2,3,4}, {1,2,3,4}, {1,2,3,4}}; // 几维数组就套几个花括号
    int a[3][4] = {1,2,3,4,1,2,3,4,1,2,3,4};  // 写在一个花括号里面，按照存储的顺序就行
//    int a[3][4] = {{1}, {4}, {7}};  // 只对部分的数据赋初始

    for(int i=0;i<5;i++)
    {
        printf("%d : %d\n",i , a[i][1]);
    }
    system("pause");
    return 0;
}